
[Flexible Renamer]
OSVersion=6200
OSVersion_PropertyTag=6110
ErrorAbort=0
Font=-12,0,0,0,400,0,0,0,0,0,0,0,34
FontFace=Tahoma
WindowPos=0:1:-1:-1:-1:-1:0:0:300:917
Scroll_SpecifyFolder=0
Page=0
Specify=1
CurrentFolder=A:\osu!\Screenshots
Scroll_SpecifyFile=0
[Rename]
RecursiveDepth=0
ModeExec=0
ApplyedPreset=2018/10/10 14:29:43
ListCtrl-1000-0-0=165,0,0,236,1,0,216,2,0,122,3,0,46,4,0,164,5,0,240,6,0,0
ListCtrl-1001-0-0=165,0,0,165,1,0,331,2,0,46,3,0,46,4,0,46,5,0,46,6,0,0
Typical_Index=3
NumberingBase=0
NumberingStep=1
Typical_Pos=0
Typical_Add=.hc
Typical_Src=
Typical_Dst=
Typical_Timestamp=\Y\m\d-\H\M\S
SelectedItem=107
EnableSub=1
AdvancedRename=1
UseScript=0
Mode=0
WildCardSearch=*.*
WildCardReplace=\Y\m\d-\H\M\S.\2
RegExpSearch=(.*?)(\.[^.]*)?$
RegExpReplace=\Y\m\d-\H\M\S\2
NumberType=0
ShowInGroup=2
CharTransSearch=
CharTransReplace=
UseUpdatedTime=1
[Preset]
Preset=0		*.*	\Y\m\d\H\M\S.\2	日時
Preset=0		*.*	??.\2	連番 + 拡張子
Preset=0		*.*	??_\1.\2	連番 + 元ファイルタイトル + 拡張子
Preset=0		*.*	\1_??.\2	元ファイルタイトル + 連番 + 拡張子
Preset=0		*-*.*	\2-\1.\3	-の左右を入れ替え
Preset=0		*DSC*	\1IMG\2	"DSC"を"IMG"に変換
Preset=1		(.*)へのショートカット(.*)?	\1\2	" へのショートカット"を削除
Preset=1		(.*?) - ショートカット(.*)?	\1\2	" - ショートカット"を削除(Vista)
Preset=1		(.*)\(\d+\)(.*)	\1\2	(数字)を削除
Preset=1		(.*)\[\d+\](.*)	\1\2	[数字]を削除
Preset=1		(.*)(?:\[\d+\])|(?:\(\d+\))(.*)	\1\2	[数字]、または(数字)を削除
Preset=1		(\..*)$	\L\1	拡張子を小文字
Preset=1		(?:コピー(?: \(\d*\))? ～ )		"コピー (数字) ～ "を削除
Preset=1		(?: - コピー(?: \(\d*\))?)		" - コピー (数字)"を削除(Vista)
Preset=1		((?:[^ \-+~=#$%&_,.(){}\[\]=!]|\.)+)	\L\u\1	語頭を大文字
Preset=2		0-9a-zA-Z０-９ａ-ｚＡ-Ｚ	０-９ａ-ｚＡ-Ｚ0-9a-zA-Z	半角 ⇔ 全角（拡張子を除く）
Preset=2		ァ-ンぁ-ん	ぁ-んァ-ン	カタカナ ⇔ ひらがな（拡張子を除く）
Preset=2		a-zA-Z	A-Za-z	大文字 ⇔ 小文字
Preset=2		a-z	A-Z	小文字 ⇒ 大文字
Preset=2		A-Z	a-z	大文字 ⇒ 小文字
Preset=2		0-9a-zA-Z	０-９ａ-ｚＡ-Ｚ	半角 ⇒ 全角（拡張子を除く）
Preset=2		０-９ａ-ｚＡ-Ｚ	0-9a-zA-Z	全角 ⇒ 半角（拡張子を除く）
Preset=0		*.*	\Y\m\d-\H\M\S.\2	Osu! Screenshot
[TagRename_PropertyTag]
Preset=5		doc;xls;ppt;vsd;mpp;pdf	18,20,21,22,23,24,33,35,126,127,143,144,145,148,150,151	ドキュメント
Preset=4		avi;mpe;mpg;wmv;asf	13,15,16,17,18,19,21,24,25,27,28,191,193,194,195,196,198,219,220,221,223,224,225,226,228,280,281,282,283,284,285,286	ビデオ
Preset=3		bmp;jpg;jpe;tif;png		イメージ
Preset=2		jpg;jpe	12,18,19,20,21,24,25,30,31,32,35,128,160,161,162,163,164,195,230,232,233,234,235,236,237,238,239,240,241,242,243,244,247,248,249,250	写真
Preset=1		mp3;wma	13,14,15,16,21,24,26,27,28,217,220	ミュージック
[TagRename]
RecursiveDepth=0
ModeExec=0
UseProperty=0
Mode=0
MusicReplace=
ListCtrl-1000-0-0=163,0,0,163,1,0,326,2,0,45,3,0,45,4,0,45,5,0,45,6,0,0
ListCtrl-1001-0-0=163,0,0,163,1,0,326,2,0,45,3,0,45,4,0,45,5,0,45,6,0,0
[RenameDestination]
Destination=C:\Users\shrmd\Videos
Destination=H:\shrmd\Videos\Games
CopyFolderStructure=1
[MainFrame]
ShowShellFolderBar=1
WindowPos=2:3:-1:-1:-1:-1:307:104:1499:984
[RenameFilter]
MRU=*
MRU=bmp;dib;gif;jpg;jpe*;png;ico;cur
MRU=htm*;htx;asp;alx;stm;shtml
MRU=txt;doc;xls;ppt;vsd
MRU=exe;dll;ocx
[MusicTagReplace]
[RenameTypical_Add]
MRU=.hc
[RenameTypical_Src]
[RenameTypical_Dst]
[Attribute]
ListCtrl-1000-0=163,0,163,1,81,2,81,3,81,4,81,5,81,6,81,7,0
ListCtrl-1001-0=163,0,163,1,81,2,81,3,81,4,81,5,81,6,81,7,0
ShiftDate=0
ShiftTime=0:00:00
RandomMin=2018/10/17 0:00:00
RandomMax=2018/10/18 0:00:00
Same=0
Shift=0
Mode=0
[NumberedObject]
ListCtrl-1000-0=617,0,308,1,
[BarState-SCBar-127]
sizeHorzCX=310
sizeHorzCY=503
sizeVertCX=310
sizeVertCY=939
sizeFloatCX=310
sizeFloatCY=503
[BarState-SCBar-126]
sizeHorzCX=175
sizeHorzCY=175
sizeVertCX=175
sizeVertCY=939
sizeFloatCX=175
sizeFloatCY=175
[BarState-Summary]
Bars=7
ScreenCX=1920
ScreenCY=1080
[WildCardSearch]
MRU=*.*
[WildCardReplace]
MRU=\Y\m\d-\H\M\S.\2
[RegExpSearch]
[RegExpReplace]
[CharTransSearch]
[CharTransReplace]
[Favorites]
Favorites=A:\osu!\Screenshots
[PresetDlg]
ListCtrl-1088-0=213,0,71,1,71,2,213,3,71,4,
[BarState-Bar0]
BarID=59392
[BarState-Bar1]
BarID=59392
[BarState-Bar2]
BarID=59396
[BarState-Bar3]
BarID=59393
[BarState-Bar4]
BarID=59420
Bars=5
Bar#0=0
Bar#1=126
Bar#2=0
Bar#3=127
Bar#4=0
[BarState-Bar5]
BarID=127
XPos=171
YPos=-2
Docking=1
MRUDockID=0
MRUDockLeftPos=171
MRUDockTopPos=-2
MRUDockRightPos=481
MRUDockBottomPos=937
MRUFloatStyle=8196
MRUFloatXPos=-2147483648
MRUFloatYPos=0
[BarState-Bar6]
BarID=126
XPos=-2
YPos=-2
Docking=1
MRUDockID=0
MRUDockLeftPos=-2
MRUDockTopPos=-2
MRUDockRightPos=173
MRUDockBottomPos=937
MRUFloatStyle=8196
MRUFloatXPos=-2147483648
MRUFloatYPos=0
